ws-asahi/WazamonoCore/megaavr/variants/WazamonoTsurugi/pins_arduino.h
/* pins_arduino.h - Variant definition for the Wazamono Tsurugi (AVR64DU32)
 * ---------------------------------------------------------------------------
 * Part of WazamonoCore (a product-specific fork of SpenceKonde/DxCore).
 * DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see LICENSE.md),
 * based on existing Arduino cores. This variant (C) Workshop Asahi 2026.
 *
 * Board   : Wazamono Tsurugi (Arduino Uno R3 form factor, AVR64DU32, USB-C)
 * MCU     : AVR64DU32  (32-pin TQFP/VQFN)
 * Clock   : external 24 MHz crystal on PA0/PA1 (XTALHF1/XTALHF2)
 *           -> boards.txt must select an external-HF-crystal clock option, so
 *              CLOCK_SOURCE & 0x03 == 1 and PA0/PA1 are removed from the GPIO map.
 *           -> USB CLK_USB (48 MHz) is still produced by OSCHF + PLL48M and is
 *              auto-tuned to the USB SOF, independently of this crystal.
 *
 *  ===== Pin numbering: Arduino Uno R3 compatible (NONCANONICAL) =====
 *   D#   MCU   Uno R3 role / notes                          A#,  AIN
 *   D0   PA5   RX  (Serial0 / USART0 RX, ALT1)              A6,  AIN25
 *   D1   PA4   TX  (Serial0 / USART0 TX, ALT1)              A7,  AIN24
 *   D2   PA6   (USART0 XCK, ALT1)                           A8,  AIN26
 *   D3   PF5   ~PWM(TCB1, ALT1)                             A9,  AIN21
 *   D4   PF4   (general I/O; no PWM - TCB0 is millis)       A10, AIN20
 *   D5   PD1   ~PWM(TCA0 WO1) | CCL                         A11, AIN1
 *   D6   PD0   ~PWM(TCA0 WO0) | CCL                         A12, AIN0
 *   D7   PD7   (general I/O; ex-AREF, VREFA disabled)       A13, AIN7
 *   D8   PA7   (general I/O, native 5V; ex-PC3 header slot) A14, AIN27
 *   D9   PD2   ~PWM(TCA0 WO2) | CCL | AC0 AINP0 | EVOUTD    A15, AIN2
 *   D10  PD3   ~PWM(TCA0 WO3) | CCL | AC0 AINN0 | (SS)      A16, AIN3
 *   D11  PD4   ~PWM(TCA0 WO4) | SPI MOSI                    A17, AIN4
 *   D12  PD5   ~PWM(TCA0 WO5) | SPI MISO                    A18, AIN5
 *   D13  PD6   SPI SCK | LED_BUILTIN (mirrored onto PC3)    A19, AIN6
 *   D14  PF0   A0 | CCL                                     A0,  AIN16
 *   D15  PF1   A1 | CCL                                     A1,  AIN17
 *   D16  PF2   A2 | CCL | EVOUTF                            A2,  AIN18
 *   D17  PF3   A3 | CCL                                     A3,  AIN19
 *   D18  PA2   A4 | SDA (I2C)                               A4,  AIN22
 *   D19  PA3   A5 | SCL (I2C)                               A5,  AIN23
 *   --- not exposed as a numbered Dn (appended so the arrays are complete) ---
 *        PC3   BUILTIN_LED driver (CCL LUT1 mirror of PD6)  index 20  (VUSB domain)
 *        PA0   XTALHF1 (24 MHz crystal)             index 21  (NOT_A_PIN)
 *        PA1   XTALHF2 (24 MHz crystal)             index 22  (NOT_A_PIN)
 *        PF6   RESET                                index 23
 *        PF7   UPDI                                 index 24  (== PIN_PF7, highest)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTD (WO0..WO5 = PD0,PD1,PD2,PD3,PD4,PD5 = D6,D5,D9,D10,D11,D12)
 *   TCB1  -> ALT1 (PF5 = D3)  : ~PWM on D3 (shared with tone(), see below)
 *   millis-> TCB0 : boards.txt passes -DMILLIS_USE_TIMERB0, so TCB1 is free for D3.
 *   tone()-> TCB1 : Tone.cpp auto-selects TCB1 when millis is on TCB0. tone() and
 *           D3 PWM share TCB1, so calling tone() suspends D3 PWM only; D11 PWM
 *           (TCA0) and millis (TCB0) keep running (cf. Uno R3 Timer2 = D3+D11).
 *   SPI0  -> ALT4 (PD4 MOSI / PD5 MISO / PD6 SCK = D11/D12/D13). Board is SPI host;
 *           default CS exposed as PIN_SPI_SS = PD3 (D10, Uno convention). The ALT4
 *           hardware SS is PD7 (= D7); run SPI host with Client Select Disable
 *           (SPI0.CTRLB.SSD = 1) so a low on D7 cannot flip host -> client mode.
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = D18/D19 = A4/A5 (Uno I2C convention).
 *   USART0-> Serial0, ALT1 (PA4 TX / PA5 RX) = D1/D0. (The Uno R3 D0/D1 UART.)
 *   USART1-> exists on the AVR DU but has NO usable pin position on Tsurugi
 *           (DU USART1 is only PD6/PD7, which are SPI SCK / D7 here). Inert.
 *   LED   -> on-board LED is driven by PC3, which hardware-mirrors PD6 (D13) via
 *           EVSYS -> CCL LUT1 (see wazamono_tsurugi_init.cpp), replacing the Uno R3
 *           op-amp buffer on pin 13. PC3 is in the VUSB domain, so the LED lights
 *           only while the USB voltage regulator is on (i.e. USB-powered).
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 *
 *   NOTE on names: the Uno R3 D0/D1 UART is wired to USART0 on this board, so the
 *   hardware UART is "Serial0" (not "Serial1" as on the Tachi). "Serial" is the
 *   native USB CDC (serial monitor), so day-to-day Serial.print() behaves exactly
 *   like a classic Uno; use "Serial0" only to talk to an external device on D0/D1.
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Informational pinout tags. DU_32PIN_PINOUT keeps DU-32 feature assumptions in
 * the core; WAZAMONO_TSURUGI_PINOUT identifies this board. NONCANONICAL_PIN_NUMBERS
 * tells the core to derive (port,bit) from the tables below instead of assuming
 * pin number == port order (our numbering does not follow port order). */
#define DU_32PIN_PINOUT
#define WAZAMONO_TSURUGI_PINOUT
#define NONCANONICAL_PIN_NUMBERS

/* ---- Digital pin number for each MCU pin (Uno R3 layout, D0..D19 contiguous) ---- */
#define PIN_PA5 (0)   // D0  RX  (USART0 RX, ALT1)
#define PIN_PA4 (1)   // D1  TX  (USART0 TX, ALT1)
#define PIN_PA6 (2)   // D2  (USART0 XCK)
#define PIN_PF5 (3)   // D3  ~PWM(TCB1, ALT1)
#define PIN_PF4 (4)   // D4  general I/O (no PWM: TCB0 = millis)
#define PIN_PD1 (5)   // D5  TCA0 WO1
#define PIN_PD0 (6)   // D6  TCA0 WO0
#define PIN_PD7 (7)   // D7  general I/O (was AREF; VREFA disabled)
#define PIN_PA7 (8)   // D8  general I/O (native 5V; ex-PC3 slot)
#define PIN_PD2 (9)   // D9  TCA0 WO2
#define PIN_PD3 (10)  // D10 TCA0 WO3 / SS (Uno convention, SSD=1)
#define PIN_PD4 (11)  // D11 TCA0 WO4 / SPI MOSI
#define PIN_PD5 (12)  // D12 TCA0 WO5 / SPI MISO
#define PIN_PD6 (13)  // D13 SPI SCK / LED_BUILTIN (mirrored to PC3 via CCL)
#define PIN_PF0 (14)  // D14 A0
#define PIN_PF1 (15)  // D15 A1
#define PIN_PF2 (16)  // D16 A2
#define PIN_PF3 (17)  // D17 A3
#define PIN_PA2 (18)  // D18 A4 / SDA
#define PIN_PA3 (19)  // D19 A5 / SCL
#define PIN_PC3 (20)  // BUILTIN_LED driver (CCL LUT1 mirror of PD6); VUSB domain; no Dn alias
#define PIN_PA0 (21)  // XTALHF1 (crystal)
#define PIN_PA1 (22)  // XTALHF2 (crystal)
#define PIN_PF6 (23)  // RESET
#define PIN_PF7 (24)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 25)

/* ---- Counts ---- */
#define PINS_COUNT                     (25)  // length of the pin tables (incl. reserved)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 25
// NUM_INTERNALLY_USED_PINS           -> auto = 2 (external crystal: PA0, PA1)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PD6)   // D13, on-board LED (Uno convention)
#endif

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

/* ---- Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used) ---- */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD0 ?  0 : (p) == PIN_PD1 ?  1 : (p) == PIN_PD2 ?  2 : (p) == PIN_PD3 ?  3 : \
    (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : \
    (p) == PIN_PF0 ? 16 : (p) == PIN_PF1 ? 17 : (p) == PIN_PF2 ? 18 : (p) == PIN_PF3 ? 19 : \
    (p) == PIN_PF4 ? 20 : (p) == PIN_PF5 ? 21 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  0 ? PIN_PD0 : (p) ==  1 ? PIN_PD1 : (p) ==  2 ? PIN_PD2 : (p) ==  3 ? PIN_PD3 : \
    (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : \
    (p) == 16 ? PIN_PF0 : (p) == 17 ? PIN_PF1 : (p) == 18 ? PIN_PF2 : (p) == 19 ? PIN_PF3 : \
    (p) == 20 ? PIN_PF4 : (p) == 21 ? PIN_PF5 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

